app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT `uploads`.* FROM `uploads`

  def show
    @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE ("uploads"."id" = 1) LIMIT 1

  def create
      @upload = Upload.new(params[:upload])
      if @upload.save!
---
INSERT INTO "uploads" ("created_at", "updated_at", "uploaded_content_type", "uploaded_file_name", "uploaded_file_size", "uploaded_updated_at") VALUES ('2011-05-22 22:17:56.777432', '2011-05-22 22:17:56.777432', NULL, NULL, NULL, NULL)